In [1]:
datapath = "queuedatabase.db"
import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect(datapath)
pd.read_sql_query("SELECT * FROM sqlite_master", cnx)["name"]
# pd.read_sql_query("SELECT * FROM simple_app_note",cnx)

0            shop
1          people
2            user
3    current_user
Name: name, dtype: object

In [2]:
pd.read_sql_query("SELECT * FROM people",cnx)

Empty DataFrame
Columns: [id, shopid, number, capacity, waitingtime, lastupdate]
Index: []

In [3]:
pd.read_sql_query('SELECT * FROM shop',cnx)

Empty DataFrame
Columns: [id, name, category, address, latitude, longitude, storespace, maxcapacity, userid]
Index: []

In [4]:
pd.read_sql_query("SELECT * FROM user",cnx)

   id name shopaddress        login password
0   1  Max      Munich  max@max.com      123

In [6]:
pd.read_sql_query("SELECT * FROM current_user",cnx)

   id userid        login password
0   1      1  max@max.com      123